Тест/Тест/src/InformationRegisters/ЗаписиЗвонков/ЗаписиЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиЗвонков</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>URL</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </resources>
  <resources>
    <name>ТипЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАудитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАудитора</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>IDКод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРОКК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АудитПроверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хороший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Плохой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Техно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НетЗамечаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/InformationRegisters/ДополнительныеНомера/ДополнительныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНомера</name>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПланНаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Добавочный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Enums/ВидыПоступлений/ВидыПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПоступлений</name>
  <enumValues>
    <name>НаличныйРасчет</name>
  </enumValues>
  <enumValues>
    <name>БезналичныйРасчет</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Enums/дт_СостоянияЗаказовКлиента/дт_СостоянияЗаказовКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дт_СостоянияЗаказовКлиента</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Думает</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Спам</name>
  </enumValues>
  <enumValues>
    <name>НетВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Дубль</name>
  </enumValues>
  <enumValues>
    <name>Срочно</name>
  </enumValues>
  <enumValues>
    <name>ЖдёмДенег</name>
  </enumValues>
  <enumValues>
    <name>Свободная</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПриход</name>
  </enumValues>
  <enumValues>
    <name>ДругаяМарка</name>
  </enumValues>
  <enumValues>
    <name>ПропущенныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>Дорого</name>
  </enumValues>
  <enumValues>
    <name>Консультация</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ПриходДенегНаСчет/ПриходДенегНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегНаСчет</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЗаказНаДоставку</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.БаланПоНакладной</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ПрочиеДоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>EnumRef.ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>DocumentRef.ЗаказНаДоставку</types>
        <types>DocumentRef.ЗаказНаряд</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ВидыРасходов/ВидыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КредитПлатеж</name>
      <description>Кредит платеж</description>
    </items>
    <items>
      <name>Топливо</name>
      <description>Топливо</description>
    </items>
  </predefined>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСписаниеДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/CommonForms/РейтингМенеджера/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|		КОГДА ПриходДенегНаСчет.Счет.ВидПеречисления = ЗНАЧЕНИЕ(перечисление.ВидыПоступлений.НаличныйРасчет)
		|			ТОГДА ПриходДенегНаСчет.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Наличные,
		|	СУММА(ВЫБОР
		|		КОГДА ПриходДенегНаСчет.Счет.ВидПеречисления = ЗНАЧЕНИЕ(перечисление.ВидыПоступлений.БезналичныйРасчет)
		|			ТОГДА ПриходДенегНаСчет.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Безнал,
		|	СУММА(ВЫБОР
		|		КОГДА ПриходДенегНаСчет.Счет.ВидПеречисления = ЗНАЧЕНИЕ(перечисление.ВидыПоступлений.БезналичныйРасчет)
		|			ТОГДА ВЫБОР
		|				КОГДА ПриходДенегНаСчет.Счет.Владелец.Налог = 20
		|				И ПриходДенегНаСчет.Дата >= &ДатаНачалаБезналБезНДС
		|					ТОГДА ВЫРАЗИТЬ(ПриходДенегНаСчет.СуммаДокумента / 1.2 КАК ЧИСЛО(20, 0))
		|				ИНАЧЕ ПриходДенегНаСчет.СуммаДокумента
		|			КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК БезналБезНДС,
		|	ПриходДенегНаСчет.Менеджер КАК Менеджер
		|ПОМЕСТИТЬ НалБезнал
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ПриходДенегНаСчет.Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиЗвонков.Менеджер КАК Менеджер,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаписиЗвонков.Дата) КАК КоличествоЗвонков
		|ПОМЕСТИТЬ ЗвонкиМенеджера
		|ИЗ
		|	РегистрСведений.ЗаписиЗвонков КАК ЗаписиЗвонков
		|ГДЕ
		|	ЗаписиЗвонков.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиЗвонков.Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КолвоЗаявок,
		|	ЗаказКлиента.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВсеЗаявкиМенеджера
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КолвоЗаявокОтказ,
		|	ЗаказКлиента.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ЗаявкиМенеджераОтказ
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (ЗаказКлиента.Состояние = ЗНАЧЕНИЕ(Перечисление.дт_СостоянияЗаказовКлиента.Отказ)
		|	ИЛИ ЗаказКлиента.Состояние = ЗНАЧЕНИЕ(Перечисление.дт_СостоянияЗаказовКлиента.Дорого))
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КолвоЗаявокДумает,
		|	ЗаказКлиента.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ЗаявкиМенеджераДумает
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказКлиента.Состояние = ЗНАЧЕНИЕ(Перечисление.дт_СостоянияЗаказовКлиента.Думает)
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КолвоЗаявокОжидание,
		|	ЗаказКлиента.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ЗаявкиМенеджераОжидание
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказКлиента.Состояние = ЗНАЧЕНИЕ(Перечисление.дт_СостоянияЗаказовКлиента.Ожидание)
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Ссылка) КАК КолвоПродаж,
		|	ПродажаЗапчастей.КтоПродал КАК КтоПродал,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КлиентыАктивные,
		|	СУММА(ПродажаЗапчастей.ИтогоРекв) КАК ИтогоРекв
		|ПОМЕСТИТЬ ВсеПродажиМенеджера
		|ИЗ
		|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
		|ГДЕ
		|	ПродажаЗапчастей.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ПродажаЗапчастей.КтоПродал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК ОбщееКоличествоКлиентов,
		|	Клиенты.Ответственный КАК Ответственный,
		|	СУММА(Клиенты.КоличествоАвтомобилей) КАК КоличествоАвтомобилей
		|ПОМЕСТИТЬ КлиентыМенеджера
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|СГРУППИРОВАТЬ ПО
		|	Клиенты.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходДенегНаСчет.Менеджер КАК Менеджер,
		|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаДокумента
		|ПОМЕСТИТЬ ПоступленияМенеджера
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	ПриходДенегНаСчет.Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расходы.Инициатор.Пользователь КАК Инициатор,
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.ВидРасхода = &ВидРасхода
		|	И Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Инициатор.Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиЗвонков.Менеджер КАК Менеджер,
		|	МАКСИМУМ(ЗаписиЗвонков.Дата) КАК ДатаПоследнегоЗвонка
		|ПОМЕСТИТЬ ПоследнийЗвонокМенеджера
		|ИЗ
		|	РегистрСведений.ЗаписиЗвонков КАК ЗаписиЗвонков
		|СГРУППИРОВАТЬ ПО
		|	ЗаписиЗвонков.Менеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеНомера.Менеджер КАК Менеджер,
		|	ВсеЗаявкиМенеджера.КолвоЗаявок КАК КолвоВсехЗаявок,
		|	ВсеПродажиМенеджера.КолвоПродаж КАК КолвоПродаж,
		|	ВсеПродажиМенеджера.ИтогоРекв КАК СуммаПродаж,
		|	ПриходДенегНаСчет.СуммаДокумента КАК СуммаПоступлений,
		|	ПриходДенегНаСчет.СуммаДокумента * 0.03 КАК ЗПМенеджера,
		|	КлиентыМенеджера.ОбщееКоличествоКлиентов КАК КоличествоКлиентов,
		|	ВсеПродажиМенеджера.КлиентыАктивные КАК Клиентыобработанные,
		|	ЗвонкиМенеджера.КоличествоЗвонков КАК КоличествоЗвонков,
		|	КлиентыМенеджера.КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	НалБезнал.Наличные КАК Наличные,
		|	НалБезнал.Безнал КАК Безнал,
		|	3000000 - ПриходДенегНаСчет.СуммаДокумента КАК ДоПлана,
		|	ЗаявкиМенеджераОтказ.КолвоЗаявокОтказ КАК КолвоЗаявокОтказ,
		|	ЗаявкиМенеджераДумает.КолвоЗаявокДумает КАК КолвоЗаявокДумает,
		|	ЗаявкиМенеджераОжидание.КолвоЗаявокОжидание КАК КолвоЗаявокОжидание
		|ИЗ
		|	РегистрСведений.ДополнительныеНомера КАК ДополнительныеНомера
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеЗаявкиМенеджера КАК ВсеЗаявкиМенеджера
		|		ПО (ДополнительныеНомера.Менеджер = ВсеЗаявкиМенеджера.Ответственный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступленияМенеджера КАК ПриходДенегНаСчет
		|		ПО (ДополнительныеНомера.Менеджер = ПриходДенегНаСчет.Менеджер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ КлиентыМенеджера КАК КлиентыМенеджера
		|		ПО (ДополнительныеНомера.Менеджер = КлиентыМенеджера.Ответственный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеПродажиМенеджера КАК ВсеПродажиМенеджера
		|		ПО (ДополнительныеНомера.Менеджер = ВсеПродажиМенеджера.КтоПродал)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗвонкиМенеджера КАК ЗвонкиМенеджера
		|		ПО (ДополнительныеНомера.Менеджер = ЗвонкиМенеджера.Менеджер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НалБезнал КАК НалБезнал
		|		ПО (ДополнительныеНомера.Менеджер = НалБезнал.Менеджер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
		|		ПО (ДополнительныеНомера.Менеджер = ВТ_Расходы.Инициатор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийЗвонокМенеджера КАК ПоследнийЗвонокМенеджера
		|		ПО (ДополнительныеНомера.Менеджер = ПоследнийЗвонокМенеджера.Менеджер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиМенеджераОтказ КАК ЗаявкиМенеджераОтказ
		|		ПО (ДополнительныеНомера.Менеджер = ЗаявкиМенеджераОтказ.Ответственный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиМенеджераДумает КАК ЗаявкиМенеджераДумает
		|		ПО (ЗаявкиМенеджераДумает.Ответственный = ДополнительныеНомера.Менеджер)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиМенеджераОжидание КАК ЗаявкиМенеджераОжидание
		|		ПО (ДополнительныеНомера.Менеджер = ЗаявкиМенеджераОжидание.Ответственный)
		|ГДЕ
		|	ДополнительныеНомера.Менеджер = &Менеджер
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеНомера.Менеджер,
		|	ПриходДенегНаСчет.СуммаДокумента,
		|	КлиентыМенеджера.ОбщееКоличествоКлиентов,
		|	ВсеПродажиМенеджера.КолвоПродаж / ВсеЗаявкиМенеджера.КолвоЗаявок * 100,
		|	ВсеЗаявкиМенеджера.КолвоЗаявок,
		|	ВсеПродажиМенеджера.КолвоПродаж,
		|	ВсеПродажиМенеджера.КлиентыАктивные,
		|	ВсеПродажиМенеджера.ИтогоРекв,
		|	ЗвонкиМенеджера.КоличествоЗвонков,
		|	КлиентыМенеджера.КоличествоАвтомобилей,
		|	НалБезнал.Наличные,
		|	НалБезнал.Безнал,
		|	ВТ_Расходы.Сумма,
		|	РАЗНОСТЬДАТ(ПоследнийЗвонокМенеджера.ДатаПоследнегоЗвонка, &ТекДата, МИНУТА),
		|	НалБезнал.БезналБезНДС,
		|	ПриходДенегНаСчет.СуммаДокумента * 0.03,
		|	3000000 - ПриходДенегНаСчет.СуммаДокумента,
		|	ВсеПродажиМенеджера.ИтогоРекв - ВТ_Расходы.Сумма,
		|	ЗаявкиМенеджераОтказ.КолвоЗаявокОтказ,
		|	ЗаявкиМенеджераДумает.КолвоЗаявокДумает,
		|	ЗаявкиМенеджераОжидание.КолвоЗаявокОжидание";
	
	Запрос.УстановитьПараметр("ДатаНачалаБезналБезНДС", Дата(2024, 11, 01));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВидРасхода", Справочники.ВидыРасходов.НайтиПоКоду("000000041"));
	Запрос.УстановитьПараметр("Менеджер", Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя));
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КоличествоЗаявок = Выборка.КолвоВсехЗаявок;
		ЗаявкиОтказ = Выборка.КолвоЗаявокОтказ;
		ЗаявкиДумает = Выборка.КолвоЗаявокДумает;
		ЗаявкиОжидание = Выборка.КолвоЗаявокОжидание;
		КоличествоПродаж = Выборка.КолвоПродаж;
		КоличествоЗвонков = Выборка.КоличествоЗвонков;
		КоличествоКлиентов = Выборка.КоличествоКлиентов;
		КлиентыОбработанные = Выборка.КлиентыОбработанные;
		СуммаПродаж = Выборка.СуммаПродаж;
		СуммаПоступлений = Выборка.СуммаПоступлений;
		Зарплата = Выборка.ЗПМенеджера;
		Наличные = Выборка.Наличные;
		Безнал =  Выборка.Безнал;
		ДоПлана = Выборка.ДоПлана;
	КонецЦикла;
	
	Заголовок = Строка(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя);
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ВидРасхода", Справочники.ВидыРасходов.НайтиПоКоду("000000041"));
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаНачалаБезналБезНДС", Дата(2024, 11, 01));
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(ТекущаяДата()));
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(ТекущаяДата()));
//	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("Менеджер", Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя));
	
КонецПроцедуры
